artifacts/product-reality/sprint-182/gates/B-12/missing-root-export/mutation.patch
diff --git a/packages/components-react/package.json b/packages/components-react/package.json
--- a/packages/components-react/package.json
+++ b/packages/components-react/package.json
@@ -17,11 +17,6 @@
     "prepack": "pnpm run build"
   },
   "exports": {
-    ".": {
-      "types": "./dist/index.d.ts",
-      "import": "./dist/index.js",
-      "require": "./dist/index.cjs"
-    },
     "./readiness": {
       "default": "./evidence/react-readiness.v1.json"
     },
