artifacts/product-reality/sprint-182/gates/B-13/missing-css-export/mutation.patch
diff --git a/packages/component-styles/package.json b/packages/component-styles/package.json
--- a/packages/component-styles/package.json
+++ b/packages/component-styles/package.json
@@ -22,9 +22,6 @@
       "import": "./dist/index.js",
       "require": "./dist/index.cjs"
     },
-    "./css": {
-      "default": "./dist/components.css"
-    },
     "./package.json": "./package.json"
   },
   "main": "./dist/index.cjs",
