artifacts/product-reality/sprint-183/m05/consumers/react/mutations/domain-action-handle-edit-inert/mutation.patch
--- a/src/main.tsx
+++ b/src/main.tsx
@@ -7,7 +7,7 @@
 if (!root) throw new Error('Missing #app hydration root.');
 window.__OODS_DOMAIN_ACTIONS__ = { handleEdit: 0, handleDelete: 0 };
 const actions = Object.freeze<ConsumerActions>({
-  handleEdit: () => { window.__OODS_DOMAIN_ACTIONS__.handleEdit += 1; },
+  handleEdit: () => undefined,
   handleDelete: () => { window.__OODS_DOMAIN_ACTIONS__.handleDelete += 1; },
 });
 window.__OODS_ACTIONS_FROZEN__ = Object.isFrozen(actions);
