artifacts/product-reality/sprint-183/m05/consumers/react/mutations/tabs-selection-behavior-removed/mutation.patch
--- a/src/GeneratedUI.tsx
+++ b/src/GeneratedUI.tsx
@@ -148,7 +148,7 @@
                             <Stack id="slot-tab-0-4" data-oods-component="Stack" />
                           </Stack>
                         ) },
-                        { ...{"id":"detail-tab-panel-5","label":"Tab 2"}, panel: (
+                        { ...{"id":"detail-tab-panel-5","label":"Tab 2","disabled":true}, panel: (
                           <Stack id="detail-tab-panel-5" data-oods-component="Stack" data-layout="stack" style={{ display: 'flex', flexDirection: 'column', gap: 'var(--ref-space-cluster-default)' }}>
                             <Stack id="slot-tab-1-6" data-oods-component="Stack" />
                           </Stack>
