artifacts/product-reality/sprint-183/m05/consumers/vue/mutations/tabs-selection-behavior-removed/mutation.patch
--- a/src/GeneratedUI.vue
+++ b/src/GeneratedUI.vue
@@ -5,7 +5,7 @@
           </Stack>
       <Card id="detail-body-10" data-oods-component="Card" data-layout="sidebar" style="align-items: start; display: grid; gap: var(--ref-space-cluster-default); grid-template-columns: minmax(0, 1fr) minmax(16rem, 24rem)">
             <div data-sidebar-main>
-              <Tabs id="detail-tabs-9" data-oods-component="Tabs" :items="[{'id':'detail-tab-panel-3','label':'Tab 1','panel':''},{'id':'detail-tab-panel-5','label':'Tab 2','panel':''},{'id':'detail-tab-panel-7','label':'Tab 3','panel':''}]">
+              <Tabs id="detail-tabs-9" data-oods-component="Tabs" :items="[{'id':'detail-tab-panel-3','label':'Tab 1','panel':''},{'id':'detail-tab-panel-5','label':'Tab 2','panel':'','disabled':true},{'id':'detail-tab-panel-7','label':'Tab 3','panel':''}]">
                         <template #panel="{ item }">
                           <template v-if="item.id === 'detail-tab-panel-3'">
                             <Stack id="detail-tab-panel-3" data-oods-component="Stack" data-layout="stack" style="display: flex; flex-direction: column; gap: var(--ref-space-cluster-default)">
