artifacts/product-reality/sprint-183/m06/mutation-replay/s182-m01b-brand-b-primary-contrast/mutation.patch
diff --git a/packages/component-styles/src/components.css b/packages/component-styles/src/components.css
--- a/packages/component-styles/src/components.css
+++ b/packages/component-styles/src/components.css
@@ -132,10 +132,6 @@
  * below the 4.5:1 text threshold. Preserve the semantic action surface and use
  * the frozen pure-white reference foreground for this one measured cell.
  */
-:is([data-brand='B'][data-theme='base'], [data-brand='B'][data-theme='light'])
-  :where(.oods-button, [data-oods-component='Button'])[data-intent='primary']:not(:disabled) {
-  color: var(--ref-color-neutral-0, white);
-}
-
+
 :where(.oods-button, [data-oods-component='Button']):disabled {
   border-color: var(--cmp-button-border-disabled, var(--sys-border-subtle, GrayText));
