artifacts/product-reality/sprint-184/m03/mutations/M01-select-placeholder-contract.patch
diff --git a/packages/component-contracts/src/contracts.ts b/packages/component-contracts/src/contracts.ts
index 61bdebc3..b6355add 100644
--- a/packages/component-contracts/src/contracts.ts
+++ b/packages/component-contracts/src/contracts.ts
@@ -60,7 +60,7 @@ export const componentContracts: Readonly<Record<NucleusComponentId, ComponentCo
   },
   Select: {
     id: 'Select', version: COMPONENT_CONTRACT_VERSION_1_1,
-    props: ['id', 'label', 'value', 'defaultValue', 'placeholder', 'required', 'disabled', 'options', 'help', 'validation'], slots: ['label', 'option', 'help', 'validation'], events: ['change', 'update'],
+    props: ['id', 'label', 'value', 'defaultValue', 'required', 'disabled', 'options', 'help', 'validation'], slots: ['label', 'option', 'help', 'validation'], events: ['change', 'update'],
     states: ['unselected', 'selected', 'disabled', 'invalid'], tokenRoles: ['input.background', 'input.border', 'input.text', 'input.focus', 'field.message'],
     accessibility: ['Native select semantics', 'Label and descriptions are associated', 'Placeholder is an explicit empty-value option'],
     compatibility: 'Native select only; no custom combobox claim.',
