artifacts/product-reality/sprint-184/m03/mutations/M02-text-label-contract.patch
diff --git a/packages/component-contracts/src/contracts.ts b/packages/component-contracts/src/contracts.ts
index 61bdebc3..d8f1b9c6 100644
--- a/packages/component-contracts/src/contracts.ts
+++ b/packages/component-contracts/src/contracts.ts
@@ -87,7 +87,7 @@ export const componentContracts: Readonly<Record<NucleusComponentId, ComponentCo
   },
   Text: {
     id: 'Text', version: COMPONENT_CONTRACT_VERSION_1_1,
-    props: ['content', 'label', 'as', 'size', 'weight'], slots: ['default'], events: [],
+    props: ['content', 'as', 'size', 'weight'], slots: ['default'], events: [],
     states: ['body', 'muted', 'emphasized'], tokenRoles: ['text.body', 'text.muted', 'font.body'], accessibility: ['Only governed safe intrinsic elements are emitted', 'Label is exposed as an accessible description'],
     compatibility: 'Defaults to span.',
   },
