artifacts/product-reality/sprint-184/m03/mutations/M03-stack-pattern-component-contract.patch
diff --git a/packages/component-contracts/src/contracts.ts b/packages/component-contracts/src/contracts.ts
index 61bdebc3..f3cb9835 100644
--- a/packages/component-contracts/src/contracts.ts
+++ b/packages/component-contracts/src/contracts.ts
@@ -67,7 +67,7 @@ export const componentContracts: Readonly<Record<NucleusComponentId, ComponentCo
   },
   Stack: {
     id: 'Stack', version: COMPONENT_CONTRACT_VERSION_1_1,
-    props: ['direction', 'gap', 'align', 'justify', 'wrap', 'patternComponent', 'fields'], slots: ['default'], events: [],
+    props: ['direction', 'gap', 'align', 'justify', 'wrap', 'fields'], slots: ['default'], events: [],
     states: ['row', 'column', 'wrapped'], tokenRoles: ['layout.gap'], accessibility: ['Does not alter child semantics'],
     compatibility: 'Maps saved-schema stack and inline modes to one flex primitive; patternComponent and fields are executed composition directives.',
   },
