artifacts/product-reality/sprint-184/m03/mutations/M05-boolean-select-field-kind.patch
diff --git a/packages/mcp-server/src/codegen/target-contracts.ts b/packages/mcp-server/src/codegen/target-contracts.ts
index 4400e35a..000d3ab9 100644
--- a/packages/mcp-server/src/codegen/target-contracts.ts
+++ b/packages/mcp-server/src/codegen/target-contracts.ts
@@ -482,8 +482,8 @@ function acceptedFieldKinds(
   if (propName === 'value') {
     if (component === 'Select') {
       return framework === 'vue'
-        ? ['string', 'boolean']
-        : ['string', 'number', 'boolean'];
+        ? ['string']
+        : ['string', 'number'];
     }
     return framework === 'vue' ? ['string'] : ['string', 'number'];
   }
