artifacts/product-reality/sprint-185/m03/mutation/react-ColorSwatch/delete-export.patch
diff --git a/packages/components-react/src/index.ts b/packages/components-react/src/index.ts
index 7e33bde2..3698dff4 100644
--- a/packages/components-react/src/index.ts
+++ b/packages/components-react/src/index.ts
@@ -3,7 +3,7 @@ export { Checkbox, DatePicker, Input, Select, Textarea } from './fields.js';
 export { Grid, Stack } from './layout.js';
 export { Table } from './table.js';
 export { Tabs } from './tabs.js';
-export { CardHeader, ColorSwatch, ColorizedBadge, DetailHeader, VizAreaPreview } from './breadth.js';
+export { CardHeader, ColorizedBadge, DetailHeader, VizAreaPreview } from './breadth.js';
 
 export type {
   BadgeProps,
