artifacts/product-reality/sprint-185/m03/mutation/vue-ColorizedBadge/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index 3a2532ae..353a7f50 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -1,5 +1,5 @@
 export { Badge, Banner, Button, Card, Grid, Stack, Text } from './primitives.js';
-export { CardHeader, ColorSwatch, ColorizedBadge, DetailHeader, VizAreaPreview } from './breadth.js';
+export { CardHeader, ColorSwatch, DetailHeader, VizAreaPreview } from './breadth.js';
 export { Checkbox, DatePicker, Input, Select, Textarea } from './fields.js';
 export {
   Table,
