artifacts/product-reality/sprint-186/m01/mutation/react-FilterPanel/delete-export.patch
diff --git a/packages/components-react/src/index.ts b/packages/components-react/src/index.ts
index 919145a5..de377c4e 100644
--- a/packages/components-react/src/index.ts
+++ b/packages/components-react/src/index.ts
@@ -4,7 +4,7 @@ export { Grid, Stack } from './layout.js';
 export { Table } from './table.js';
 export { Tabs } from './tabs.js';
 export {
-  CardHeader, ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel, PriceSummary, VizAreaPreview,
+  CardHeader, ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader, PriceSummary, VizAreaPreview,
 } from './breadth.js';
 
 export type {
