artifacts/product-reality/sprint-186/m01/mutation/vue-ClassificationPanel/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index ac9b16cf..0d2ee320 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -1,6 +1,6 @@
 export { Badge, Banner, Button, Card, Grid, Stack, Text } from './primitives.js';
 export {
-  CardHeader, ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel, PriceSummary, VizAreaPreview,
+  CardHeader, ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel, PriceSummary, VizAreaPreview,
 } from './breadth.js';
 export { Checkbox, DatePicker, Input, Select, Textarea } from './fields.js';
 export {
