artifacts/product-reality/sprint-186/m02/mutation-attempt-1-cell-selector/react-AddressCollectionPanel/delete-export.patch
diff --git a/packages/components-react/src/index.ts b/packages/components-react/src/index.ts
index bc2c7b49..15f01ea0 100644
--- a/packages/components-react/src/index.ts
+++ b/packages/components-react/src/index.ts
@@ -4,7 +4,7 @@ export { Grid, Stack } from './layout.js';
 export { Table } from './table.js';
 export { Tabs } from './tabs.js';
 export {
-  AddressCollectionPanel, CardHeader, ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel,
+  CardHeader, ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel,
   MembershipPanel, PreferencePanel, PriceSummary, TagManager, VizAreaPreview,
 } from './breadth.js';
 
