artifacts/product-reality/sprint-186/m02/mutation/react-TagManager/delete-export.patch
diff --git a/packages/components-react/src/index.ts b/packages/components-react/src/index.ts
index bc2c7b49..66881948 100644
--- a/packages/components-react/src/index.ts
+++ b/packages/components-react/src/index.ts
@@ -5,7 +5,7 @@ export { Table } from './table.js';
 export { Tabs } from './tabs.js';
 export {
   AddressCollectionPanel, CardHeader, ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel,
-  MembershipPanel, PreferencePanel, PriceSummary, TagManager, VizAreaPreview,
+  MembershipPanel, PreferencePanel, PriceSummary, VizAreaPreview,
 } from './breadth.js';
 
 export type {
