artifacts/product-reality/sprint-186/m03/mutation/react-AddressSummaryBadge/delete-export.patch
diff --git a/packages/components-react/src/index.ts b/packages/components-react/src/index.ts
index 88149c01..a670c576 100644
--- a/packages/components-react/src/index.ts
+++ b/packages/components-react/src/index.ts
@@ -4,7 +4,7 @@ export { Grid, Stack } from './layout.js';
 export { Table } from './table.js';
 export { Tabs } from './tabs.js';
 export {
-  AddressCollectionPanel, AddressSummaryBadge, CardHeader, ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader,
+  AddressCollectionPanel, CardHeader, ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader,
   FilterPanel, MembershipPanel, MessageStatusBadge, PreferencePanel, PreferenceSummaryBadge, PriceSummary, RoleBadgeList,
   TagManager, TagPills, VizAreaPreview,
 } from './breadth.js';
