artifacts/product-reality/sprint-186/m03/mutation/react-RoleBadgeList/delete-export.patch
diff --git a/packages/components-react/src/index.ts b/packages/components-react/src/index.ts
index 88149c01..5bac05c1 100644
--- a/packages/components-react/src/index.ts
+++ b/packages/components-react/src/index.ts
@@ -5,8 +5,7 @@ export { Table } from './table.js';
 export { Tabs } from './tabs.js';
 export {
   AddressCollectionPanel, AddressSummaryBadge, CardHeader, ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader,
-  FilterPanel, MembershipPanel, MessageStatusBadge, PreferencePanel, PreferenceSummaryBadge, PriceSummary, RoleBadgeList,
-  TagManager, TagPills, VizAreaPreview,
+  FilterPanel, MembershipPanel, MessageStatusBadge, PreferencePanel, PreferenceSummaryBadge, PriceSummary, TagManager, TagPills, VizAreaPreview,
 } from './breadth.js';
 
 export type {
