artifacts/product-reality/sprint-186/m03/mutation/vue-MessageStatusBadge/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index 125dbb12..8fe4a210 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -1,7 +1,7 @@
 export { Badge, Banner, Button, Card, Grid, Stack, Text } from './primitives.js';
 export {
   AddressCollectionPanel, AddressSummaryBadge, CardHeader, ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader,
-  FilterPanel, MembershipPanel, MessageStatusBadge, PreferencePanel, PreferenceSummaryBadge, PriceSummary, RoleBadgeList,
+  FilterPanel, MembershipPanel, PreferencePanel, PreferenceSummaryBadge, PriceSummary, RoleBadgeList,
   TagManager, TagPills, VizAreaPreview,
 } from './breadth.js';
 export { Checkbox, DatePicker, Input, Select, Textarea } from './fields.js';
