artifacts/product-reality/sprint-186/m03/mutation/vue-TagPills/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index 125dbb12..03a72679 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -2,7 +2,7 @@ export { Badge, Banner, Button, Card, Grid, Stack, Text } from './primitives.js'
 export {
   AddressCollectionPanel, AddressSummaryBadge, CardHeader, ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader,
   FilterPanel, MembershipPanel, MessageStatusBadge, PreferencePanel, PreferenceSummaryBadge, PriceSummary, RoleBadgeList,
-  TagManager, TagPills, VizAreaPreview,
+  TagManager, VizAreaPreview,
 } from './breadth.js';
 export { Checkbox, DatePicker, Input, Select, Textarea } from './fields.js';
 export {
