artifacts/product-reality/sprint-186/m04/mutation/vue-AddressValidationTimeline/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index 1f38c42b..5d8aae54 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -1,6 +1,6 @@
 export { Badge, Banner, Button, Card, Grid, Stack, Text } from './primitives.js';
 export {
-  AddressCollectionPanel, AddressSummaryBadge, AddressValidationTimeline, AuditEvent, CardHeader, ClassificationPanel,
+  AddressCollectionPanel, AddressSummaryBadge, AuditEvent, CardHeader, ClassificationPanel,
   ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel, MembershipAuditTimeline, MembershipPanel, MessageEventTimeline,
   MessageStatusBadge, PreferencePanel, PreferenceSummaryBadge, PreferenceTimeline, PriceSummary, RoleBadgeList,
   TagManager, TagPills, VizAreaPreview,
