artifacts/product-reality/sprint-186/m04/mutation/vue-MessageEventTimeline/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index 1f38c42b..0e8bdccc 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -1,8 +1,7 @@
 export { Badge, Banner, Button, Card, Grid, Stack, Text } from './primitives.js';
 export {
   AddressCollectionPanel, AddressSummaryBadge, AddressValidationTimeline, AuditEvent, CardHeader, ClassificationPanel,
-  ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel, MembershipAuditTimeline, MembershipPanel, MessageEventTimeline,
-  MessageStatusBadge, PreferencePanel, PreferenceSummaryBadge, PreferenceTimeline, PriceSummary, RoleBadgeList,
+  ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel, MembershipAuditTimeline, MembershipPanel, MessageStatusBadge, PreferencePanel, PreferenceSummaryBadge, PreferenceTimeline, PriceSummary, RoleBadgeList,
   TagManager, TagPills, VizAreaPreview,
 } from './breadth.js';
 export { Checkbox, DatePicker, Input, Select, Textarea } from './fields.js';
