artifacts/product-reality/sprint-186/m04/mutation/vue-PreferenceTimeline/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index 1f38c42b..ad39747d 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -2,7 +2,7 @@ export { Badge, Banner, Button, Card, Grid, Stack, Text } from './primitives.js'
 export {
   AddressCollectionPanel, AddressSummaryBadge, AddressValidationTimeline, AuditEvent, CardHeader, ClassificationPanel,
   ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel, MembershipAuditTimeline, MembershipPanel, MessageEventTimeline,
-  MessageStatusBadge, PreferencePanel, PreferenceSummaryBadge, PreferenceTimeline, PriceSummary, RoleBadgeList,
+  MessageStatusBadge, PreferencePanel, PreferenceSummaryBadge, PriceSummary, RoleBadgeList,
   TagManager, TagPills, VizAreaPreview,
 } from './breadth.js';
 export { Checkbox, DatePicker, Input, Select, Textarea } from './fields.js';
