artifacts/product-reality/sprint-186/m05/mutation/react-PreferenceEditor/delete-export.patch
diff --git a/packages/components-react/src/index.ts b/packages/components-react/src/index.ts
index f1126332..4a318ab0 100644
--- a/packages/components-react/src/index.ts
+++ b/packages/components-react/src/index.ts
@@ -6,7 +6,7 @@ export { Tabs } from './tabs.js';
 export {
   AddressCollectionPanel, AddressEditor, AddressSummaryBadge, AddressValidationTimeline, AuditEvent, CardHeader,
   ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel, MembershipAuditTimeline, MembershipPanel,
-  MessageEventTimeline, MessageStatusBadge, PreferenceEditor, PreferencePanel, PreferenceSummaryBadge, PreferenceTimeline,
+  MessageEventTimeline, MessageStatusBadge, PreferencePanel, PreferenceSummaryBadge, PreferenceTimeline,
   PriceSummary, RoleAssignmentForm, RoleBadgeList, StatusSelector, TagInput, TagManager, TagPills, TemplatePicker,
   VizAreaPreview,
 } from './breadth.js';
