artifacts/product-reality/sprint-186/m05/mutation/react-TemplatePicker/delete-export.patch
diff --git a/packages/components-react/src/index.ts b/packages/components-react/src/index.ts
index f1126332..827b48fa 100644
--- a/packages/components-react/src/index.ts
+++ b/packages/components-react/src/index.ts
@@ -7,8 +7,7 @@ export {
   AddressCollectionPanel, AddressEditor, AddressSummaryBadge, AddressValidationTimeline, AuditEvent, CardHeader,
   ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel, MembershipAuditTimeline, MembershipPanel,
   MessageEventTimeline, MessageStatusBadge, PreferenceEditor, PreferencePanel, PreferenceSummaryBadge, PreferenceTimeline,
-  PriceSummary, RoleAssignmentForm, RoleBadgeList, StatusSelector, TagInput, TagManager, TagPills, TemplatePicker,
-  VizAreaPreview,
+  PriceSummary, RoleAssignmentForm, RoleBadgeList, StatusSelector, TagInput, TagManager, TagPills, VizAreaPreview,
 } from './breadth.js';
 
 export type {
