artifacts/product-reality/sprint-186/m05/mutation/vue-AddressEditor/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index 0891d434..7711fc67 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -1,6 +1,6 @@
 export { Badge, Banner, Button, Card, Grid, Stack, Text } from './primitives.js';
 export {
-  AddressCollectionPanel, AddressEditor, AddressSummaryBadge, AddressValidationTimeline, AuditEvent, CardHeader,
+  AddressCollectionPanel, AddressSummaryBadge, AddressValidationTimeline, AuditEvent, CardHeader,
   ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel, MembershipAuditTimeline, MembershipPanel,
   MessageEventTimeline, MessageStatusBadge, PreferenceEditor, PreferencePanel, PreferenceSummaryBadge, PreferenceTimeline,
   PriceSummary, RoleAssignmentForm, RoleBadgeList, StatusSelector, TagInput, TagManager, TagPills, TemplatePicker,
