artifacts/product-reality/sprint-186/m05/mutation/vue-TagInput/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index 0891d434..bf0085f6 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -3,7 +3,7 @@ export {
   AddressCollectionPanel, AddressEditor, AddressSummaryBadge, AddressValidationTimeline, AuditEvent, CardHeader,
   ClassificationPanel, ColorSwatch, ColorizedBadge, DetailHeader, FilterPanel, MembershipAuditTimeline, MembershipPanel,
   MessageEventTimeline, MessageStatusBadge, PreferenceEditor, PreferencePanel, PreferenceSummaryBadge, PreferenceTimeline,
-  PriceSummary, RoleAssignmentForm, RoleBadgeList, StatusSelector, TagInput, TagManager, TagPills, TemplatePicker,
+  PriceSummary, RoleAssignmentForm, RoleBadgeList, StatusSelector, TagManager, TagPills, TemplatePicker,
   VizAreaPreview,
 } from './breadth.js';
 export { Checkbox, DatePicker, Input, Select, Textarea } from './fields.js';
