artifacts/product-reality/sprint-187/m02/mutation-attempt-1/react-ClassificationBadge/delete-export.patch
diff --git a/packages/components-react/src/index.ts b/packages/components-react/src/index.ts
index 2e4496d0..44cccb92 100644
--- a/packages/components-react/src/index.ts
+++ b/packages/components-react/src/index.ts
@@ -17,7 +17,7 @@ export {
   MessageEventTimeline, MessageStatusBadge, PreferenceEditor, PreferencePanel, PreferenceSummaryBadge, PreferenceTimeline,
   PriceSummary, RoleAssignmentForm, RoleBadgeList, StatusSelector, TagInput, TagManager, TagPills, TemplatePicker,
   VizAreaPreview,
-  LabelCell, InlineLabel, FormLabelGroup, ClassificationBadge, ClassificationEditor,
+  LabelCell, InlineLabel, FormLabelGroup, ClassificationEditor,
 } from './breadth.js';
 
 export type {
