artifacts/product-reality/sprint-187/m02/mutation-attempt-1/vue-LabelCell/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index 3df7a047..d3b44174 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -5,7 +5,7 @@ export {
   MessageEventTimeline, MessageStatusBadge, PreferenceEditor, PreferencePanel, PreferenceSummaryBadge, PreferenceTimeline,
   PriceSummary, RoleAssignmentForm, RoleBadgeList, StatusSelector, TagInput, TagManager, TagPills, TemplatePicker,
   VizAreaPreview,
-  LabelCell, InlineLabel, FormLabelGroup, ClassificationBadge, ClassificationEditor,
+  InlineLabel, FormLabelGroup, ClassificationBadge, ClassificationEditor,
 } from './breadth.js';
 export { Checkbox, DatePicker, Input, Select, Textarea } from './fields.js';
 export {
