artifacts/product-reality/sprint-187/m03/mutation-attempt-1/react-OwnershipMeta/delete-export.patch
diff --git a/packages/components-react/src/index.ts b/packages/components-react/src/index.ts
index 3caba355..82317797 100644
--- a/packages/components-react/src/index.ts
+++ b/packages/components-react/src/index.ts
@@ -91,5 +91,5 @@ export type {
   LabelCellProps, InlineLabelProps, FormLabelGroupProps, ClassificationBadgeProps, ClassificationEditorProps,
 } from './types.js';
 
-export { OwnerBadge, OwnershipSummary, OwnershipMeta, TagSummary } from './breadth.js';
+export { OwnerBadge, OwnershipSummary, TagSummary } from './breadth.js';
 export type { OwnerBadgeProps, OwnershipSummaryProps, OwnershipMetaProps, TagSummaryProps } from './types.js';
