artifacts/product-reality/sprint-187/m03/mutation-attempt-1/vue-OwnerBadge/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index 7f3c0e4e..848f9c82 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -74,5 +74,5 @@ export type {
   LabelCellProps, InlineLabelProps, FormLabelGroupProps, ClassificationBadgeProps, ClassificationEditorProps,
 } from './types.js';
 
-export { OwnerBadge, OwnershipSummary, OwnershipMeta, TagSummary } from './breadth.js';
+export { OwnershipSummary, OwnershipMeta, TagSummary } from './breadth.js';
 export type { OwnerBadgeProps, OwnershipSummaryProps, OwnershipMetaProps, TagSummaryProps } from './types.js';
