artifacts/product-reality/sprint-187/m04/mutation-attempt-1/react-CancellationForm/delete-export.patch
diff --git a/packages/components-react/src/index.ts b/packages/components-react/src/index.ts
index 116cca18..7649ec33 100644
--- a/packages/components-react/src/index.ts
+++ b/packages/components-react/src/index.ts
@@ -94,5 +94,5 @@ export type {
 export { OwnerBadge, OwnershipSummary, OwnershipMeta, TagSummary } from './breadth.js';
 export type { OwnerBadgeProps, OwnershipSummaryProps, OwnershipMetaProps, TagSummaryProps } from './types.js';
 
-export { ArchiveSummary, ArchivePill, CancellationForm, CancellationBadge, PriceCardMeta } from './breadth.js';
+export { ArchiveSummary, ArchivePill, CancellationBadge, PriceCardMeta } from './breadth.js';
 export type { ArchiveSummaryProps, ArchivePillProps, CancellationFormProps, CancellationBadgeProps, PriceCardMetaProps } from './types.js';
