artifacts/product-reality/sprint-187/m04/mutation-attempt-1/vue-ArchiveSummary/delete-export.patch
diff --git a/packages/components-vue/src/index.ts b/packages/components-vue/src/index.ts
index cf0fb348..17d8f8a0 100644
--- a/packages/components-vue/src/index.ts
+++ b/packages/components-vue/src/index.ts
@@ -77,5 +77,5 @@ export type {
 export { OwnerBadge, OwnershipSummary, OwnershipMeta, TagSummary } from './breadth.js';
 export type { OwnerBadgeProps, OwnershipSummaryProps, OwnershipMetaProps, TagSummaryProps } from './types.js';
 
-export { ArchiveSummary, ArchivePill, CancellationForm, CancellationBadge, PriceCardMeta } from './breadth.js';
+export { ArchivePill, CancellationForm, CancellationBadge, PriceCardMeta } from './breadth.js';
 export type { ArchiveSummaryProps, ArchivePillProps, CancellationFormProps, CancellationBadgeProps, PriceCardMetaProps } from './types.js';
